Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: ཕྱོགས་བཅུར་ཐུབ་པའི་དབང་པོ་གང་དག་ཀྱང་། །འགྲོ་བ་རྣམས་ལ་ཕན་ཕྱིར་འཁོར་ལོ་སྐོར། །ད་དུང་ཐེག་པའི་དམ་ཚིག་གང་འདོད་པ། །བདག་གི་གན་དུ་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་། །
en: “Though the lords of sages in the ten directions Turn the Dharma wheel for the sake of beings, Right now I see before me bodhisattvas Who desire the vows of this vehicle.

source: ལན་གཉིས་སུ་ཡང་འཁོར་ལོ་བདག་སྐོར་ཏེ། །ཕྱིར་མི་ལྡོག་ལ་སེམས་ཅན་བྱེ་བཀོད་པ། །རྣམ་པར་གྲོལ་བའི་བློ་མཚན་རབ་ཐོགས་ཤིང་། །བདག་བདག་ཞིང་རྣམས་སུ་ཡང་འགྲོ་བར་འགྱུར། །
en: “I will turn the Dharma wheel a second time And the millions of beings I establish in the state of nonregression Will manifest signs that their minds have been liberated And then return to their respective realms.

source: སངས་རྒྱས་ཞིང་འདིར་འོངས་པ་གང་དག་ཀྱང་། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་ཕྱིར་བཟོད་པ་བསྟན། །
en: “I will reveal this acceptance so that those who have come To this buddha realm can engage in the conduct of supreme awakening.

source: ཉན་ཐོས་རང་རྒྱལ་ཐེག་པ་ཅན་མཐོང་སྟེ། །དེ་བས་མུ་སྟེགས་གཞན་ཀུན་འདིར་འདུལ་ལོ། །
en: Those who follow the vehicles of the hearers and the solitary buddhas will see, And all the non-Buddhists will be tamed.”

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་དེ་ཡང་དེ་ལྟར་བཅོམ་ལྡན་འདས་ཀྱི་ཡི་གེ་དང་། དོན་དང་། ཚིག་བརྗོད་པའི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་མུ་མེད་པར་སོང་ངོ་། །
en: The blessed Buddha’s melodious waves of verse—the melodious waves of the Blessed One’s syllables, words, and meaning—spread throughout the countless buddha realms of the ten directions.

source: དེ་ན་སེམས་ཅན་གང་ལ་ལ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་དེ་ཐམས་ཅད་ཉན་ཅིང་དེ་ཕྱོགས་བཅུར་ཡང་ལྟ་བར་འགྱུར་རོ། །བདག་ཅག་གིས་བལྟ་བའི་སེམས་ཅན་དེ་སེམས་ཅན་གང་གི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་དེ་ལྟར་ཡིད་དུ་འོང་བ་དེ་ལྟར་དགའ་བ། དེ་ལྟར་མངོན་པར་དགའ་བ།
en: All the beings in those realms who followed the Great Vehicle heard them and gazed into the ten directions.

source: དེ་ལྟར་ཟབ་ཅིང་སེམས་ཅན་གྱི་དབུགས་འབྱིན་པ། དེ་ལྟར་ཚིམ་པ། དེ་ལྟར་འཁོར་བའི་ཕ་རོལ་ཏུ་འགྲོ་བ། དོན་དང་ཚིག་དང་། ཡི་གེ་བརྗོད་པའི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་དེ་བཞིན་དུ་སྨྲ་བར་བྱ་བ་ཇི་ལྟ་བ་དེར་དེ་ཕྱོགས་བཞི་ཀུན་ཏུ་བལྟས་ཏེ།
en: They gazed out at all of the beings they could see in the four directions, looking for the being whose melodious waves of verse were so delightful, pleasing, utterly pleasing, and profound, and to see how one could utter such melodious waves of verse expressing the meaning, words, and letters that bring relief to beings, satisfy them, and lead them to the other shore of saṃsāra.

source: སངས་རྒྱས་ཀྱི་མཐུས་སྤོས་ཀྱི་ངད་ལྡང་བའི་རི་ལ་དྲང་སྲོང་ཐུབ་པ་དབང་པོ་ཞི་ཞིང་ཐུགས་ཞི་བ།
en: Through the power of the Buddha, they saw myriad seers not very far away who were prostrating to the Sage on Mount Gandhamādana.

source: དུལ་བ་དང་། ཞི་བའི་མཆོག་ཐོབ་པ། གསེར་གྱི་ཕུང་པོ་ཇི་ལྟར་འབར་བ་ལ་དྲང་སྲོང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོས་མངོན་སུམ་དུ་ཕྱག་འཚལ་ཏེ།
en: His senses were pacified, his mind was tranquil and under control, he had reached supreme peace, and he was blazing like a heap of gold.

source: ཧ་ཅང་ཡང་མི་རིང་བར་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ། དྲང་སྲོང་འདི་ནི་མཐུ་ཆེན་པོ་དྲང་སྲོང་གི་འཁོར་ཆེན་པོ་འདི་ནི་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་བ་ཞིག་སྙམ་སྟེ།
en: When they saw him, they thought, “This seer is very powerful, and his great assembly of seers is endowed with great compassion.

source: གལ་ཏེ་སྙིང་རྗེ་དང་ལྡན་པར་འགྱུར་བ་དེའི་རྗེས་སུ་འགྲོའོ། །དྲང་སྲོང་གི་ཆ་བྱད་དང་།
en: Since he is compassionate, we should follow him!”

source: ལུས་དང་། དབྱིབས་ཀྱིས་བདག་གི་ལུས་སུ་གྱུར་པ་དེ་དག་མཐོང་ནས། དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ཅག་ཀྱང་དྲང་སྲོང་དུ་གྱུར་ན། དྲང་སྲོང་ཆེན་པོ་དེ་ལ་བསྙེན་བཀུར་བ་དང་།
en: When they saw that their bodies had taken on the dress, the physical appearances, and the shapes of seers, they thought, “Since we have become seers, we should go serve and pay homage to that great seer!”

source: ཕྱག་འཚལ་བའི་ཕྱིར་ཉེ་བར་འགྲོའོ། །དེ་དག་ཀྱང་སེམས་བསྐྱེད་མ་ཐག་པས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་གྲངས་མེད་པ་ལས་དྲང་སྲོང་གི་ཆ་བྱད་ཚད་མེད་གྲངས་མེད་བསམ་གྱིས་མི་ཁྱབ། མཚུངས་པ་མེད་ཅིང་དཔག་ཏུ་མེད་པ། ཆུ་བོ་གང་གཱའི་བྱེ་མ་སྙེད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་མངོན་པར་ལྷགས་སོ། །
en: As soon as this thought had arisen in their minds, immeasurable, innumerable, inconceivable, unequaled, and infinite numbers of bodhisattvas dressed as seers, as numerous as all the grains of sand in the Ganges, arrived in this buddha realm from immeasurable and countless buddha realms in the ten directions.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པའི་ཚོགས་སྣ་ཚོགས་ཀྱི་དྲང་སྲོང་ཐུབ་པ་ལ་མཆོད་པ་བྱས་ནས། དྲང་སྲོང་ཐུབ་པ་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ཏེ། ཕྱག་འཚལ་ནས་བསྟོད་དེ་འཁོད་དོ། །
en: The crowd of magical bodhisattva emanations made up of various types of seers made offerings to the Sage, prostrated to him with their palms joined, praised him, and took their seats.

source: ལ་ལ་སྨོན་ལམ་གྱི་དབང་དང་། ལ་ལ་ངན་དུ་སྤྱོད་པའི་རྐྱེན་གྱིས་གང་ཡང་ངན་སོང་དུ་སྐྱེས་པ་དེ་དག་སངས་རྒྱས་ཀྱི་མཐུས་དྲན་པ་སོ་སོར་ཐོབ་ནས་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་ཀུན་ཏུ་འཁོད་དོ། །
en: Through the power of the Buddha, those who were born in the lower realms, due either to the power of their aspirations or to the conditions of their negative actions, attained each of the recollections, were dressed as seers, and took their seats.

source: དྲང་སྲོང་ཆེན་པོ་ཐུབ་པའི་དབང་པོ་གང་ན་བ་དེ་ལོགས་སུ་ཡང་ཐལ་མོ་སྦྱར་ཏེ་འཁོད་དོ། །
en: They all sat down with their palms together facing the great seer, the lord of sages.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་ཀྱི་ཚོགས་མཐའ་ཡས་པའི་རྒྱལ་པོ་སངས་རྒྱས་ཀྱི་མཐུས་འདི་སྙམ་དུ་སེམས་ཏེ། ཤཱཀྱ་ཐུབ་པ་བཞུགས་ཤིང་ཇི་ལྟ་བུར་འཁོར་ཡང་དག་པར་འོངས་པ་ལ་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པ་འདི་གང་ན་སྟོན་པར་འགྱུར།
en: Then, through the power of the Buddha, the bodhisattva King of the Infinite Accumulation of Wisdom wondered, “Where will Śākyamuni reside when he teaches this acceptance that tames beings with the sky-colored method of perfect conduct to the gathering that has assembled here?”

source: དེ་ནས་དེ་ཉིད་ཀྱི་ཚེ་ན་ཤར་ཕྱོགས་ཀྱི་ནམ་མཁའི་ལམ་ལས་ཁང་པ་བརྩེགས་པ་བལྟ་ན་སྡུག་པ། རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་གང་བ་སྣ་ཚོགས་འདི་ལྟ་སྟེ། དཔེར་ན་བརྒྱ་བྱིན་ལྷའི་དབང་པོ་ཞེས་བྱ་བའི་ཁང་པ་བརྩེགས་པ་ལྟ་བུ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་ལྷགས་སོ། །
en: At that moment, six sextillion magnificent storied mansions filled with the seven precious substances and resembling the mansion of Śakra, lord of the gods, appeared in the sky from the east.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་ཀྱི་ཚོགས་མཐའ་ཡས་པའི་རྒྱལ་པོ་ཁང་པ་བརྩེགས་པ་དེ་མཐོང་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གིས་ཁང་པ་བརྩེགས་པ་འདི་ལྟ་སྟེ། དཔེར་ན་ཚངས་པ་མི་མཇེད་ཀྱི་བདག་པོའི་ཁང་པ་བརྩེགས་པ་དབྱངས་ཞི་བ་འདི་འདྲ་བར་སྤྲུལ་ཏེ།
en: When he saw those mansions, the bodhisattva King of the Infinite Accumulation of Wisdom thought, “I will manifest a storied mansion similar to the lord of the Sahā world Brahmā’s mansion, Peaceful Melody.

source: དྲང་སྲོང་ཐུབ་པ་གང་ན་བཞུགས་པ་དེར་བདག་བཟོད་པ་འདི་བསྟན་སྙམ་པ་དང་།
en: This is where the sage Seer will reside when he teaches us this acceptance.”

source: དེ་ཉིད་ཀྱི་ཚེ་ན་ལྷོ་ཕྱོགས་ནས་ནམ་མཁའི་ལམ་ལས་ཁང་པ་བརྩེགས་པ་བལྟ་ན་སྡུག་པ། རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་གང་བ་སྣ་ཚོགས་འདི་ལྟ་སྟེ། དཔེར་ན་ཚངས་པ་མི་མཇེད་ཀྱི་བདག་པོའི་ཁང་པ་བརྩེགས་པ་དབྱངས་ཞི་བ་ལྟ་བུ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་ལྷགས་པ་མཐོང་ནས།
en: At that moment, six sextillion magnificent storied mansions filled with the seven precious substances and resembling the lord of the Sahā world Brahmā’s mansion, Peaceful Melody, appeared in the sky from the south.

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་ཀྱི་ཚོགས་མཐའ་ཡས་པའི་རྒྱལ་པོ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གིས་འདི་ལྟ་སྟེ་དཔེར་ན་ཚངས་པ་ཆེན་པོ་གློག་གི་འོད་ཅེས་བྱ་བའི་ཁང་པ་བརྩེགས་པ་དེ་འདྲ་བར་མངོན་པར་སྤྲུལ་ཏེ།
en: When he saw those mansions, the bodhisattva King of the Infinite Accumulation of Wisdom thought, “I will manifest a storied mansion similar to Brahmā’s mansion, Flash of Lightning.

source: བཅོམ་ལྡན་འདས་དེ་ན་བཞུགས་ཤིང་ཆོས་སྟོན་ཏོ་སྙམ་པ་དང་།
en: This is where the Blessed One will reside as he teaches the Dharma.”

source: དེ་ནས་དེ་ཉིད་ཀྱི་ཚེ་ན་ནུབ་ཕྱོགས་ནས་ནམ་མཁའི་ལམ་ལས་འདི་ལྟ་སྟེ། དཔེར་ན་ཚངས་པ་གློག་གི་འོད་ཅེས་བྱ་བའི་ཁང་པ་བརྩེགས་པ་བལྟ་ན་སྡུག་པ་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་གང་བ་སྣ་ཚོགས་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་ལྷགས་སོ། །
en: At that moment, six sextillion magnificent storied mansions filled with the seven precious substances and resembling Brahmā’s mansion, Flash of Lightning, appeared in the sky from the west.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་ཀྱི་ཚོགས་མཐའ་ཡས་པའི་རྒྱལ་པོ་འདི་སྙམ་དུ་སེམས་ཏེ་བདག་གིས་ཁང་པ་བརྩེགས་པ་འདི་ལྟ་སྟེ། དཔེར་ན་ཚངས་པ་རི་རབ་ཀྱི་འོད་ཅེས་བྱ་བའི་ཁང་པ་བརྩེགས་པ་དེ་འདྲ་བ་མངོན་པར་སྤྲུལ་ཏེ།
en: The bodhisattva King of the Infinite Accumulation of Wisdom then thought, “I will manifest a storied mansion similar to Brahmā’s mansion, Light of Sumeru.

source: དེ་ནས་དེ་ཉིད་ཀྱི་ཚེ་ན་བྱང་ཕྱོགས་ནས་ནམ་མཁའི་ལམ་ལས་ཁང་པ་བརྩེགས་པ་བལྟ་ན་སྡུག་པ། རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་གང་བ་སྣ་ཚོགས་འདི་ལྟ་སྟེ། དཔེར་ན་ཚངས་པ་ཆེན་པོ་རི་རབ་ཀྱི་འོད་ཅེས་བྱ་བའི་ཁང་པ་བརྩེགས་པ་དོར་བ་མེད་པ་དང་ལྡན་པ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་ལྷགས་སོ། །
en: At that moment, six sextillion magnificent storied mansions filled with the seven precious substances and resembling Great Brahmā’s mansion, Light of Sumeru, in its entirety appeared in the sky from the north.

source: དེ་ནས་ཡང་དེའི་ཚེ་ན་ཁང་པ་བརྩེགས་པ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་ནམ་མཁའ་ལ་འཁོད་དོ། །
en: At that point myriads of storied mansions were arrayed in the sky.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་འདི་སྙམ་དུ་སེམས་ཏེ། ཁང་པ་བརྩེགས་པ་དེ་དག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱི་དོན་གྱི་ཕྱིར་སེང་གེའི་ཁྲི་ལ་རྣམ་པར་བལྟས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་དོན་གྱི་ཕྱིར་སེང་གེའི་ཁྲི་བཤམས་པའི་ཁང་པ་བརྩེགས་པ་གང་ཞིག་སྙམ་སྟེ།
en: The bodhisattva Maitreya thought, “I have searched those mansions for a lion throne for the Blessed One, and there is one mansion in which a lion throne has been prepared for the Blessed One.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་བྱང་ཆུབ་སེམས་དཔའ་གཟི་བརྗིད་དྲི་མ་མེད་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁང་པ་བརྩེགས་པ་འདི་དག་གང་དུ་ལྷགས།
en: The bodhisattva Maitreya then asked the bodhisattva Immaculate Splendor, “Noble son, where did these storied mansions come from?

source: སུ་ཡི་བྱིན་གྱིས་བརླབས།
en: Who has manifested them?”

source: བྱང་ཆུབ་སེམས་དཔའ་གཟི་བརྗིད་དྲི་མ་མེད་པས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ལ་སྨྲས་པ། རིགས་ཀྱི་བུ་དེ་བས་ན་ཆོས་ཀྱི་སྒོས་ཆགས་པ་ཐམས་ཅད་རྒྱུན་བཅད་པའི་ཕྱིར་ད་དུང་མི་སྒྲུབ་ཀྱི། འདི་གཉིས་ཀྱིས་འཁོར་བ་འཁྱིལ་པའི་སྒྲུབ་པའོ། །
en: The bodhisattva Immaculate Splendor replied, “Noble son, as long as one has not brought about the elimination of all manner of attachment using the gateway of the Dharma, two things bring about the round of saṃsāra.

source: རིགས་ཀྱི་བུ་འདི་གཉིས་ནི་འགྲོ་བ་དང་འོང་བའོ། །འདི་གཉིས་ནི་འབྱུང་བ་དང་འཇིག་པ་ཞེས་བྱ་སྟེ།
en: Noble son, the two are going and coming, and these two are called origination and disintegration.

source: གང་མི་སྐྱེ་མི་འབྱུང་བ་དེ་འགྲོ་བ་དང་འོང་བའི་འདུ་ཤེས་ཀྱང་མེད་དོ། །
en: When there is no arising and no origination, there is also no perception of going and coming.

source: དེ་འཇིག་པ་ཐམས་ཅད་སྤངས་ནས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: When all forms of disintegration are abandoned, one achieves the acceptance of the unborn nature of phenomena.

source: འཁོར་བའི་རྒྱུན་གཅོད་པ་འདི་ནི་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོའོ། །
en: This is the gateway to the Dharma of nonduality that cuts off the continuation of saṃsāra.

source: གང་འགྲོ་བ་དང་འོང་བ་ཞེས་བྱ་བ་འདི་གཉིས་ནི་འགྲོ་བ་དང་འོང་བའོ། །རིགས་ཀྱི་བུ་གང་བདག་ཏུ་སྒྲོ་འདོགས་པ་མེད་པ་དང་། སྲོག་དང་། གསོ་བ་དང་། གང་ཟག་དང་།
en: These two are the going and coming to which one refers when they speak of going and coming.

source: ཤེད་ལས་སྐྱེས་པ་དང་། ཤེད་ཅན་དང་། འགྲོ་བ་དང་། འོང་བའི་འདུ་ཤེས་སུ་འཇུག་པ་མེད་པ། འདི་ནི་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་ལ་འཇུག་པའོ། །
en: “Noble son, when there is nothing imputed as a self and no entertaining notions of a life force, soul, person, humans, living creatures, going, or coming, this is the entrance to the gateway to the Dharma of nonduality.

source: རིགས་ཀྱི་བུ་གང་སྐྱེས་པའམ། མ་སྐྱེས་པར་རྟོག་པ་འདི་ནི་གཉིས་པའོ། །གང་འབྱུང་བ་དང་།
en: “Noble son, when there are concepts of arising and the absence of arising, this is dualistic.

source: འགོག་པར་རྣམ་པར་མི་རྟོག་ཅིང་འགྲོ་བ་དང་འོང་བར་དམིགས་པ་མེད་པ་དང་། ཐ་དད་པར་བྱ་བ་མེད་པ་དང་། འགྱུར་བ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་འདི་ནི་རིགས་ཀྱི་བུ་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་ལ་འཇུག་པའོ། །
en: When one has no concept of origination and cessation and there is no observation of going and coming, nothing to be differentiated, and no transformation, this utter purity, noble son, is the entrance to the gateway to the Dharma of nonduality.

source: ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་དང་ཕུང་པོ་སྐྱེ་བ་དང་། འཇིག་པའི་མཚན་ཉིད་འདི་ནི་གཉིས་པའོ། །
en: “Things that are characterized by arising and disintegration such as the aggregates, their affliction, and their purification are dualistic.

source: གང་ཕུང་པོ་ཡོངས་སུ་ཤེས་ཤིང་སྐྱེ་བ་དང་། འཇིག་པའི་མཚན་ཉིད་སྤངས་པ་རློམ་སེམས་ཐམས་ཅད་བཅོམ་པ། གཟུགས་ཀྱི་འགོག་པར་འགྲོ་བའི་ལམ་འདི་ནི་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་ལ་འཇུག་པའོ། །
en: When one thoroughly understands the aggregates, has abandoned things that are characterized by arising and disintegration, and has overcome all thought, this path that leads to the cessation of form is the entrance to the gateway to the Dharma of nonduality.

source: འགུལ་བ་དང་། རློམ་ཞིང་སེམས་པར་རིག་པ་འདི་ནི་གཉིས་པའོ། །
en: “Wavering and the knowledge derived from thoughts and reflection are dualistic.

source: གང་ཚོར་བའི་འགུལ་བ་མེད་ཅིང་རློམ་སེམས་མེད་པ། གཡོ་བ་མེད་ཅིང་ཡིད་ལ་མི་བྱེད་པ་འདི་ནི་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་ལ་འཇུག་པའོ། །
en: When there is no wavering of feelings and no thought, this absence of mental fluctuation and absence of mental engagement is the entrance to the gateway to the Dharma of nonduality.

source: རིགས་ཀྱི་བུ་གང་ཚོར་བར་ཤེས་པ་དང་། ཚོར་བ་ཀུན་འབྱུང་བར་ཤེས་པ་དང་། ཚོར་བའི་འགོག་པར་ཤེས་པ་དང་། ཚོར་བ་འགོག་པར་འགྲོ་བའི་ལམ་དུ་ཤེས་པ་འདི་ནི་གཉིས་པའོ། །རིགས་ཀྱི་བུ་གང་ཡང་ཚོར་བ་ཀུན་འབྱུང་བར་འགོག་པར་འགྲོ་བར་མི་ཤེས་པ་དང་། གཟུགས་ཀྱི་ཕུང་པོ་དང་། ཚོར་བའི་ཕུང་པོའི་མཚན་ཉིད་ཐ་དད་པར་མི་ཤེས་པ་དང་།
en: “Noble son, perceiving feelings, the origin of feelings, the cessation of feelings, and the path leading to the cessation of feelings is dualistic.

source: མཉམ་པའི་མཚན་ཉིད་དང་། མཚན་ཉིད་མེད་པ་དང་། མཚན་ཉིད་ཐ་དད་པ་དང་། མཚན་ཉིད་གཅིག་པ་དང་། མཚན་ཉིད་མང་པོར་མི་ཤེས་པ་འདི་ཡང་རིགས་ཀྱི་བུ་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་ལ་འཇུག་པའོ། །
en: Noble son, when one does not perceive feelings, their origin, or the path leading to their cessation; when one does not perceive the characteristics of the aggregate of form and the aggregate of feeling as different; and when one does not perceive them as having the same characteristics, lacking characteristics, having different characteristics, having a single characteristic, or having manifold characteristics, this, noble son, is the entrance to the gateway of the Dharma of nonduality.

source: ཡང་རིགས་ཀྱི་བུ་གང་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ལ་ཉན་ཐོས་དང་། རང་བྱང་ཆུབ་འདོད་པ་དང་། བླ་ན་མེད་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་འདོད་པ་འདི་ནི་གཉིས་པའོ། །རིགས་ཀྱི་བུ་གང་ཡང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་དང་། ཕུང་པོ་དང་།
en: “Furthermore, noble son, when there is attachment among hearers and solitary buddhas to the aggregates, elements, and sense fields, and attachment to the unsurpassed wisdom of the omniscient ones, this is dualistic.

source: ཁམས་དང་། སྐྱེ་མཆེད་ལ་བརྟེན་པར་མི་ཤེས་པ་དང་། ཡི་གེའི་ཚིག་གི་ལམ་ཐམས་ཅད་ནི་གནས་མེད་པ། ཡི་གེ་མེད་པ། སྤྲོས་པ་མེད་པར་རབ་ཏུ་ཤེས་པ་འདི་ཡང་རིགས་ཀྱི་བུ་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་ལ་འཇུག་པའོ། །
en: When one does not perceive any basis for the vehicles of the hearers and solitary buddhas, omniscient wisdom, or the aggregates, elements, or sense fields, and one understands that all means of verbal expression are baseless, without letters, and without elaboration, this, noble son, is the entrance to the gateway of the Dharma of nonduality.

source: རིགས་ཀྱི་བུ་གང་དགེ་བ་དང་། མི་དགེ་བར་འདུ་ཤེས་ཀུན་ཏུ་ཤེས་པ་དང་། ཕ་རོལ་དང་ཚུ་རོལ་ཏུ་འདུ་ཤེས་པ་འདི་ནི་གཉིས་པའོ། རིགས་ཀྱི་བུ་གང་དགེ་བ་མི་དགེ་བ་འདི་ཡང་མཚན་མ་མེད་པ་ཀུན་ནས་ལྡང་བ་དང་།
en: “Noble son, when one perceives perceptions as virtuous and nonvirtuous, this perception in terms of this and that side is dualistic.

source: མི་ཟད་པ་ཀུན་ཏུ་རྟོག་པ་འདི་ཡང་རིགས་ཀྱི་བུ་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་ལ་འཇུག་པའོ། །
en: When one realizes that these virtuous and nonvirtuous perceptions lack traits, are always arising, and are inexhaustible, this is the entrance to the gate of the Dharma of nonduality.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ཚུ་རོལ་ནི་ཟག་པའོ། །ཕ་རོལ་ནི་ཕྱིན་ཅི་ལོག་སྟེ་གང་ཚུ་རོལ་དང་ཕ་རོལ་ལ་རྟོག་པ་དང་། འཛིན་པ་དང་བཀྲོལ་བ་འདི་ནི་གཉིས་པའོ། །
en: “Noble son, conceiving of, fixating upon, or commenting on this side and that side by saying ‘this side is defiled and that side is wrong’ is dualistic.

source: གང་ཡང་ཚུ་རོལ་དང་ཕ་རོལ་ལ་འཛིན་པ་མེད་པ་དང་། བཀྲོལ་བ་མེད་པ་དང་། ཅི་ལ་ཡང་བཏགས་པ་མེད་པ་དང་། བཏང་བ་མེད་པ་འདི་ནི་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་ལ་འཇུག་པའོ། །
en: When there is no fixating on this or that side, no commenting, no analysis whatsoever, and no rejection, this is the entrance to the gateway to the Dharma of nonduality.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་གང་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ལ་ཟག་པ་དང་བཅས་པའམ། ཟག་པ་མེད་པའམ་ཞེས་རྟོག་པ་འདི་ནི་གཉིས་པའོ། །
en: “Noble son, concepts such as the aggregates, elements, and sense fields being defiled or not defiled are dualistic.

source: གང་ཡང་ཁམས་དང་། སྐྱེ་མཆེད་ལ་ཟག་པ་དང་བཅས་པ་ཞེས་རྟོག་པ་མེད་པ་དང་། ཟག་པ་མེད་པའི་འདུ་ཤེས་སུ་བྱ་བའང་མེད་པ་དང་། འདུ་ཤེས་དང་འདུ་ཤེས་མེད་མིན་ཐོབ་པའང་མེད་པ་འདི་ཡང་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་ལ་འཇུག་པའོ། །
en: When there is no concept that the elements and sense fields are defiled, nothing that might be perceived as undefiled, no perception and no nonperception, and no attainment, this is the entrance to the gateway to the Dharma of nonduality.

source: རིགས་ཀྱི་བུ་གང་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ལ་འདུས་བྱས་དང་། འདུས་མ་བྱས་སུ་རྟོག་པ་འདི་ནི་གཉིས་པའོ། །
en: “Noble son, when the aggregates, the elements, and the sense fields are conceptualized as being conditioned or unconditioned, this is dualistic.

source: གང་ཡང་འདུ་བྱེད་སྐྱེ་མཆེད་ཐམས་ཅད་ལ་མི་རྟོག་ཅིང་རྣམ་པར་མི་རྟོག་པ་དང་། ཆོས་ཐམས་ཅད་ནམ་མཁའ་དང་མཉམ་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་འདི་ཡང་རིགས་ཀྱི་བུ་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་ལ་འཇུག་པའོ། །
en: But when one does not conceptualize any and all perceptions and there is no conceptual thought, and when one sees correctly that all phenomena are like space, this, noble son, is the entrance to the gateway to the Dharma of nonduality.

source: རིགས་ཀྱི་བུ་གང་ཡང་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ལ་སྙེམས་པ་འདི་ནི་གཉིས་པའོ། །གང་ལ་ལ་འཇིག་རྟེན་པ་དང་།
en: “Noble son, when one takes pride in mundane and supramundane qualities, this is dualistic.

source: འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ལ་མི་འཇུག་མི་འགྲོ །རྣམ་པར་མི་འགྲོ །མི་རྒལ་ཞིང་འགྲོ་བ་ཡང་མེད། རྣམ་པར་འགྲོ་བ་མེད་པ་འདིའང་གཉིས་སུ་མེད་པའི་ཆོས་ལ་འཇུག་པའོ། །
en: When one does not engage in, move toward, move away from, or overcome mundane and supramundane qualities and there is no going toward and no moving away, this is the entrance to the gate of the Dharma of nonduality.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་གང་ལ་ལ་མིང་དང་གཟུགས་ལས་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་འབྱུང་བར་རབ་ཏུ་ཤེས་པ་འདི་ནི་གཉིས་པའོ། །
en: “Furthermore, noble son, understanding the aggregates, the elements, and the sense fields as originating on the basis of name and form is dualistic.

source: ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་དང་། མིང་དང་གཟུགས་བྲལ་བ་ལ་སྒྱུ་མའི་རང་བཞིན་གྱི་ལྟ་བ་ཀུན་ཏུ་འགྲོ་ཞིང་ཀུན་ཏུ་མི་འགྲོ །ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་པ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་ལ་འཇུག་པའོ། །
en: Having the view that the aggregates, elements, and sense fields, being devoid of name and form, have the nature of an illusion, and are both all-pervading and not all-pervading, and do not pass into ultimate nirvāṇa, is the bodhisattvas’ entrance to the gateway to the Dharma of nonduality.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་གང་རྣམ་པར་ཤེས་པ་འབྱུང་བར་རབ་ཏུ་ཤེས་པ་འདི་ནི་གཉིས་པའོ། །
en: “Furthermore, noble son, understanding consciousness in terms of origination is dualistic.

source: གང་ཡང་འབྱུང་བ་མེད་པ་སྐད་ཅིག་མ་དང་སྐད་ཅིག་མ་མ་ཡིན་པ་ལ་འདུས་བྱས་ཐམས་ཅད་དུ་མྱུར་དུ་རབ་ཏུ་ཤེས་པ་འདི་ཡང་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་ལ་འཇུག་པའོ། །
en: But when one instantly understands that all compounded phenomena, being unoriginated, are momentary and not momentary, this is an entrance to the gate of the Dharma of nonduality.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བདག་གིར་བྱ་བ་དང་། རྣམ་པར་ཤེས་པར་ཡོངས་སུ་ཤེས་པ་དང་། ང་ཡིར་བྱ་བ་དང་། སྐྱེ་མཆེད་ལ་ཆགས་པ་འདི་ནི་གཉིས་པའོ། །
en: “Furthermore, noble son, attachment to ownership, to knowledge based on ordinary consciousness, to possession, and to the sense fields is dualistic.

source: གང་ལ་ལ་བདག་དང་བྲལ་བའི་རྣམ་པར་ཤེས་པ་ཐོབ་པ་བདག་གི་རང་བཞིན་ལྟ་བ་གཉིས་དང་བྲལ་བ། སྐྱེ་མཆེད་ཉམས་པ་མེད་པ། བདག་གིར་བྱ་བ་དང་། ང་ཡིར་བྱ་བ་དང་བྲལ་བ་འདི་ཡང་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་ལ་འཇུག་པའོ། །
en: But when one achieves consciousness that is devoid of a self and is free from the two views of the nature of the self, when the sense fields are undefiled, and when one is free from ownership and possession, this is the entrance to the gateway to the Dharma of nonduality.

source: གང་ལ་ལ་རིག་པ་དང་། རྣམ་པར་གྲོལ་བར་རྟོག་པ་འདི་ནི་གཉིས་པའོ། །
en: “Any conceptual thought about knowledge and liberation is dualistic.

source: རིགས་ཀྱི་བུ་མ་རིག་པ་ནི་རྒྱུ་བ་མེད་ཅིང་བདག་མེད་པའོ། །
en: Noble son, knowledge lacks mental activity and lacks a self.

source: རིག་པ་ནི་གློག་གི་རང་བཞིན་ཅན་ནོ། །
en: Knowledge is like a flash of lightning.

source: རྣམ་པར་གྲོལ་བ་ཡང་ནམ་མཁའོ། །ནམ་མཁའ་ཡང་མི་རྟོག་པ། རྟོག་པར་བྱེད་པ་མེད་པ།
en: Liberation is like space, and space is nonconceptual, does not conceptualize, and is free from elaborations.

source: སྤྲོས་པ་མེད་པ་འདི་ཡང་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་ལ་འཇུག་པའོ། །
en: This is the entrance to the gateway to the Dharma of nonconceptuality.

source: གང་རྣམ་པར་ཤེས་པ་དང་། གཟུགས་ཀུན་ཏུ་སྤྱོད་པ་འདི་ནི་གཉིས་པའོ། །
en: “The enjoyment of consciousness and form is dualistic.

source: གཟུགས་ཉིད་ཀྱང་ནམ་མཁའ་བཞིན་དུ་སྟོང་སྟེ། ནམ་མཁའ་ཡང་འཇིག་པ་མེད་དོ། །
en: Form itself is empty, like space, and space does not disintegrate.

source: གཟུགས་འཇིག་པ་སྟོང་པ་ཉིད་གཟུགས་ཀྱི་མཚན་ཉིད་རབ་ཏུ་རྒྱུ་བ་སྟོང་པ་ཉིད་ཀྱི་རང་བཞིན་ཡང་སྟོང་པ་ཉིད་དོ། །
en: Forms that disintegrate, being empty, are manifestations with the characteristic of form and are empty, as they also have the nature of emptiness.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་ཀྱང་དེ་བཞིན་ནོ། །
en: The same goes for feelings, perceptions, and formations.

source: རྣམ་པར་ཤེས་པ་རབ་ཏུ་རྒྱུ་བ་མེད་པ་ནི་ནམ་མཁའ་ཇི་ལྟ་བུར་མུན་པ་མེད་ཅིང་སྣང་བ་མེད་པ་རྣམ་པར་ཤེས་པའང་དེ་བཞིན་ནོ། །
en: The nonmanifestation of consciousness is akin to consciousness that is devoid of darkness and light, like space.

source: རྣམ་པར་ཤེས་པའི་འཇིག་པ་སྟོང་པ་མ་ཡིན་ཏེ། རྣམ་པར་ཤེས་པའི་རང་བཞིན་ཉིད་ཀྱང་སྟོང་པའོ། །
en: The disintegration of consciousness is not emptiness, but the nature of consciousness itself is indeed emptiness.

source: དེ་བཞིན་དུ་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ཡང་ནམ་མཁའི་རང་བཞིན་ལྟར་སྟོང་ངོ་། །ནམ་མཁའ་ཇི་ལྟ་བུར་འདོད་ཆགས་མེད། ཞེ་སྡང་མེད།
en: The five aggregates that are the basis of grasping are empty in the same way, like the nature of space.

source: གཏི་མུག་མེད། མི་མཐོ་མི་དམའ། མི་རྟོག་རྣམ་པར་མི་རྟོག །མི་འགྲོ་རྣམ་པར་མི་འགྲོ །དེ་ལྟར་སེམས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ལ་ཡང་འདོད་ཆགས་མེད།
en: Bodhisattvas who think of them as being like space—lacking attachment, anger, and ignorance, without high and low, without conceptual thought or conceptualization, and without going and ceasing—perfectly understand all phenomena exactly as they are.
